# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, INSNl, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 1, INSNl, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 1, INSNl, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, INSNl, [1024]],
   [-1, 1, CBAM, [1024]], # 9
   [-1, 1, SPPF, [1024, 5]],  # 10
  ]

# YOLOv5 v6.0 BiFPN head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 12
   [[-1, 6], 1, Concat, [1]],  # 13cat backbone P4
   [-1, 3, INSNs, [512, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],  # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 16
   [[-1, 4], 1, Concat, [1]],  # 17 cat backbone P3
   [-1, 3, INSNs, [256, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 19
   [[-1, 15, 6], 1, BiFPN_Add3, [256, 256]],  # 20 cat head P4
   [-1, 3, INSNs, [512, False]],  # 21 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  # 22
   [[-1, 11, 9], 1, BiFPN_Add3, [512, 512]],  # 23 cat head P5
   [-1, 3, INSNs, [1024, False]],  # 24 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]